Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.GetOptions Method (ComponentOptions)
 Returns the value of the component options.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool GetOptions(
	ref ComponentOptions Options
)
Public Shared Function GetOptions (
	ByRef Options As ComponentOptions
) As Boolean
Parameters
Options
Type: Tekla.Structures.ComponentOptions
The returned value of the component options.
Return Value
Type: Boolean
 True if the values were successfully retrieved.
See Also
Reference
TeklaStructuresSettings Class
GetOptions Overload
Tekla.Structures Namespace